app/controllers/notes_controller.rb

SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."race_id" = $1  [["race_id", 2]]
---
  def index
    @race = Race.find(params:[:race_id])
    @notes = Note.where(race_id: @race.id)

SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @race = Race.find(params[:race_id])
    @note = Note.find(params[:id])

INSERT INTO "notes" ("message", "finish_time", "bib_number", "race_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["message", "add a new note"], ["finish_time", "02:00:00"], ["bib_number", 22222], ["race_id", 1], ["created_at", "2019-08-13 17:05:41.683583"], ["updated_at", "2019-08-13 17:05:41.683583"]]
---
  def create
    @note = Note.new(note_params)
    if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "notes" SET "message" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["message", "Steve is here too"], ["updated_at", "2019-08-13 18:01:35.114933"], ["id", 4]]
---
  def update
    @note = Note.find(params[:id])
    if @note.update(note_params)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 2]]
---
  def destroy
    @note = Note.find(params:[:id])
    if @note.destroy