app/controllers/races_controller.rb

  def index
    @user = User.find(params[:user_id])
    @races = Race.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "races".* FROM "races" ORDER BY updated_at DESC

  def show
    @race = Race.find(params[:id])
---
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @race = Race.new(race_params)
    if @race.save
---
INSERT INTO "races" ("name", "date", "description", "city", "state", "country", "organization", "distance", "website", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    @race = Race.find(params[:id])
    if @race.update(race_params)
---
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "races" SET "distance" = $1, "updated_at" = $2 WHERE "races"."id" = $3  [["distance", 12.0], ["updated_at", "2019-08-13 20:57:08.546136"], ["id", 2]]

  def destroy
    @race = Race.find(params[:id])
    if @race.destroy
---
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "races" WHERE "races"."id" = $1  [["id", 3]]

  def set_race
    @race = Race.find(params[:id])
---
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]