app/controllers/races_controller.rb

SELECT  "races".* FROM "races" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 5]]
---
  def newest5
    @races = Race.all.order("created_at DESC").limit(5)