app/controllers/users_controller.rb

  def newusers
    @users = User.all.order("updated_at DESC")
---
SELECT "users".* FROM "users" ORDER BY updated_at DESC

  def show_public
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "name", "email", "dob", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"